app/views/home/items.html.erb

SELECT  "events".* FROM "events" WHERE "events"."e_key" = ?  ORDER BY "events"."id" ASC LIMIT 1  [["e_key", "sample"]]
---
		 					  <td>
    					    <%= link_to Event.where(e_key: i.e_key).first.e_name, controller: "events", action: "event_detail", e_key: i.e_key %>